Обработки/Reports/_ЖурналУчетаИмуществаПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЖурналУчетаИмуществаПИФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьШапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЖурналУчетаИмуществаПИФ/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Структура = Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант);
	Подписант = РаботаСОтчетами.ПолучитьКонтактноеЛицо(Структура);
	Отчет.Выгружать = Ложь;
	
	НастроитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//Элементы.Результат.ИспользуемоеИмяФайла = "Журнал учета имущества " + СокрЛП(Отчет.ПаевойИнвестиционныйФонд) + " с " + Формат(Отчет.Период.ДатаНачала, "ДЛФ=DD") + " по " + Формат(Отчет.Период.ДатаОкончания, "ДЛФ=DD");
	Отчет.СчетДоверительногоУправления = "";
	ОпределитьКаталогВыгрузки();
	УстановитьИспользуемоеИмяФайла();
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОчистка(Элемент, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//Элементы.Результат.ИспользуемоеИмяФайла = "Журнал учета имущества " + СокрЛП(Отчет.ПаевойИнвестиционныйФонд) + " с " + Формат(Отчет.Период.ДатаНачала, "ДЛФ=DD") + " по " + Формат(Отчет.Период.ДатаОкончания, "ДЛФ=DD");
	
	ОпределитьКаталогВыгрузки();
	УстановитьИспользуемоеИмяФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ПаевойИнвестиционныйФондНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ПолучитьСписокПИФДляВыбора(Отчет.Период.ДатаОкончания, Отчет.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.КаталогДанных);

КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		
	ПутьКФайлу = Отчет.КаталогДанных;
	
	// Если в пути не содержится указание на файл, ничего не делаем
	НомерПозиции = СтрНайти(НРег(ПутьКФайлу), ".xls", НаправлениеПоиска.СКонца);
	
	ТекИмяФайла = "";
	ТекКаталог  = ПутьКФайлу;
	Если НомерПозиции > 0 Тогда                             	
		НомерПозиции = СтрНайти(ПутьКФайлу, "\", НаправлениеПоиска.СКонца);
				
		Если НомерПозиции > 0 Тогда
			ТекИмяФайла = Сред(ПутьКФайлу, НомерПозиции);
			ТекКаталог	= Лев(ПутьКФайлу, НомерПозиции - 1);
		КонецЕсли;                                          		
	КонецЕсли;	
	
	Диалог.Каталог            = ТекКаталог; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда
		
		Отказ = Ложь;
		РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(Диалог.Каталог, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ТекИмяФайла = Диалог.Каталог + ТекИмяФайла;
		
		НомерПозиции = СтрНайти(НРег(ТекИмяФайла), ".xls", НаправлениеПоиска.СКонца);	
		Если НомерПозиции = 0 Тогда                             	
			//Дополняем именем файла
			СокрИмяПИФ = СократитьНазваниеПИФ(СокрЛП(Отчет.ПаевойИнвестиционныйФонд));
			ТекИмяФайла = ТекИмяФайла + "\" + "Журнал учета " + СокрИмяПИФ + " " + Формат(Отчет.Период.ДатаНачала, "ДФ=yyyyMMdd") + "-" + Формат(Отчет.Период.ДатаОкончания, "ДФ=yyyyMMdd") + ".xlsx";	
        КонецЕсли;
		
		Отчет.КаталогДанных = ТекИмяФайла;
		УстановитьИспользуемоеИмяФайла();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)

	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СкомпоноватьРезультат();
	
	Если Отчет.Выгружать И (Не ПустаяСтрока(Отчет.КаталогДанных)) Тогда
		
		ПроверяемыйФайл = Новый Файл(Отчет.КаталогДанных);
						
		Отказ = Ложь;
		РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(ПроверяемыйФайл.Путь, Отказ);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
		Попытка		
			Результат.Записать(Отчет.КаталогДанных, ТипФайлаТабличногоДокумента.XLSX);	
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыгружатьПриИзменении(Элемент)
	
	НастроитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	Если Не (ЭтаФорма.НастройкиОтчета.Свойство("Период") И ЭтаФорма.НастройкиОтчета.Свойство("Подписант")) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для отчета 'Журнал имущества ПИФ' не установлены настройки периода и подписанта");
		Возврат;
	КонецЕсли;
	
	Если Не ЭтаФорма.НастройкиОтчета.Подписант.Свойство("КонтактноеЛицо") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для отчета 'Журнал имущества ПИФ' не установлена настройка подписанта");
		Возврат;
	КонецЕсли;
	
	Отчет.Период = ЭтаФорма.НастройкиОтчета.Период;
	
	ЭтаФорма.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", ЭтаФорма.НастройкиОтчета.Подписант);
	
	СкомпоноватьРезультат();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПИФДляВыбора(Дата, Организация)
	
	Результат = Новый СписокЗначений;
	
	МассивПИФ = Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Дата, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо"), Истина);
	
	Для Каждого ТекПИФ Из МассивПИФ Цикл
		Результат.Добавить(ТекПИФ);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОпределитьКаталогВыгрузки()
	
	Если Не (ЗначениеЗаполнено(Отчет.ПаевойИнвестиционныйФонд) Или ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления)) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|			&Период,
	|			ВЫБОР
	|					КОГДА &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.)
	|						ТОГДА (ВЫРАЗИТЬ(Клиент КАК Справочник.ПаевыеИнвестиционныеФонды)) = &ПаевойИнвестиционныйФонд
	|					ИНАЧЕ СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				КОНЕЦ
	|				И СчетДоверительногоУправления.Организация = &Организация
	|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения >= &Период)) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 						КонецДня(Отчет.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", 		Отчет.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Организация", 					Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Отчет.СчетДоверительногоУправления);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отчет.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.СсылкаНаОтчет) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Отчеты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Отчеты КАК Отчеты
		|ГДЕ
		|	Отчеты.Ключ.Наименование ПОДОБНО ""%Журнал учета имущества ПИФ%""
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Отчет.СсылкаНаОтчет = Выборка.Ссылка;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для отчета 'Журнал учета имущества' не найдена ссылка в справочнике отчетов. Путь выгрузки отчета не определен!");
			Отчет.КаталогДанных = "";
			Возврат;
		КонецЕсли;
		
	КонецЕсли; 	
	
	//ПРАВИЛЬНОЕ ПОЛУЧЕНИЕ НАСТРОЕК ПО СЧЕТУ ДУ
	ПутьИзНастроек = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьЗначениеНастройки(Отчет.Период.ДатаОкончания, Отчет.СчетДоверительногоУправления, Отчет.СсылкаНаОтчет, "ПутьКФайлу");
	
	Если ПутьИзНастроек = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для отчета 'Журнал учета имущества' не задана настройка 'Путь к файлу' для выбранного счета ДУ. Путь выгрузки отчета не определен!");
		Возврат;
	КонецЕсли;	
	
	СтрокаОтчета = Новый Структура;
	
	СтрокаОтчета.Вставить("Отчет",			Отчет.СсылкаНаОтчет);
	СтрокаОтчета.Вставить("Субъект",		Отчет.СчетДоверительногоУправления);
	СтрокаОтчета.Вставить("Периодичность",	Неопределено);
	СтрокаОтчета.Вставить("ДатаНачала",		Отчет.Период.ДатаНачала);
	СтрокаОтчета.Вставить("ДатаОкончания",	Отчет.Период.ДатаОкончания);
	
	Отчет.КаталогДанных = РегистрыСведений.СоставИНастройкиОтчетов.ОбработатьПутьКФайлу(ПутьИзНастроек, СтрокаОтчета);
	
КонецПроцедуры // ОпределитьКаталогВыгрузки()

&НаКлиенте
Функция СократитьНазваниеПИФ(СтрПИФ)
	
	Если СтрПИФ = "" Тогда
		Возврат СтрПИФ;
	КонецЕсли;
	
	Кавычки = Прав(СтрПИФ, 1);
	
	СтрПИФ = СтрЗаменить(СтрПИФ, Кавычки, "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " комбинированный", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " смешанных инвестиций", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " рыночных финансовых инструментов", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " долгосрочных прямых инвестиций", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " прямых инвестиций", "");
	
	Возврат СтрПИФ;
	
КонецФункции

&НаКлиенте
Процедура УстановитьИспользуемоеИмяФайла()
	
	Если ПустаяСтрока(Отчет.КаталогДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Результат.ИспользуемоеИмяФайла = Отчет.КаталогДанных;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступность()
	
	Элементы.КаталогДанных.ТолькоПросмотр = Не Отчет.Выгружать;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
	Если Отчет.Выгружать И ПустаяСтрока(Отчет.КаталогДанных) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан файл для сохранения отчета",,, "Отчет.КаталогДанных", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
